spec/fixtures/webhooks/payment_succeeded.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "invoice.payment_succeeded",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2016-07-06",
  "data": {
    "object": {
      "id": "in_00000000000000",
      "object": "invoice",
      "amount_due": 0,
      "application_fee": null,
      "attempt_count": 0,
      "attempted": true,
      "charge": "_00000000000000",
      "closed": true,
      "currency": "usd",
      "customer": "cus_00000000000000",
      "date": 1475362200,
      "description": null,
      "discount": null,
      "ending_balance": 10,
      "forgiven": false,
      "lines": {
        "data": [
          {
            "id": "sub_9GnQhj6xzJivdE",
            "object": "line_item",
            "amount": 5,
            "currency": "usd",
            "description": null,
            "discountable": true,
            "livemode": true,
            "metadata": {},
            "period": {
              "start": 1477552623,
              "end": 1480231023
            },
            "plan": {
              "id": "silver-staff-902",
              "object": "plan",
              "amount": 999,
              "created": 1474869223,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "name": "Silver Staff",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "proration": false,
            "quantity": 1,
            "subscription": null,
            "type": "subscription"
          }
        ],
        "total_count": 1,
        "object": "list",
        "url": "/v1/invoices/in_18zwIuLZSHMPGdYE4huWgPxG/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "paid": true,
      "period_end": 1475362200,
      "period_start": 1474960623,
      "receipt_number": null,
      "starting_balance": 5,
      "statement_descriptor": null,
      "subscription": "sub_00000000000000",
      "subtotal": 5,
      "tax": null,
      "tax_percent": null,
      "total": 5,
      "webhooks_delivered_at": 1475362200
    }
  }
}
